app/views/lists/index.html.erb

          <p>
            <%= pluralize(list.tasks.count, 'task in total', 'tasks in total') %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = 1