app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1 ORDER BY created_at asc
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."list_id" = 3
---
  def show
    @list = List.find(params[:id])
    @tasks = @list.tasks.order(sort_column + ' ' + sort_direction)

    @task = @list.tasks.build if @list.tasks.empty?

INSERT INTO "lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 19 Mar 2014 00:33:59 UTC +00:00], ["title", "To-Do Rails Test"], ["updated_at", Wed, 19 Mar 2014 00:33:59 UTC +00:00]]
---
  def create
    @list = List.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "lists" SET "title" = 'asldfkjaslkdjf', "updated_at" = '2014-03-25 01:33:16.344233' WHERE "lists"."id" = 1
---
  def update
    @list = List.find(params[:id])

    respond_to do |format|
      if @list.update_attributes(params[:list])

UPDATE "tasks" SET "complete" = 't' WHERE "tasks"."id" IN (3, 1)
---
  def mark_completed_tasks
    Task.update_all({complete: true}, {id: params[:task_ids]})